
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://terrateam.mindplex.ai/i/100311661/runs/98b581fd-7676-4768-96ff-6edbc784e168).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## terraform/dev | default | Success :thumbsup:
**Dir**: terraform/dev
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mindplex_semantic.aws_ecs_service.this will be updated in-place
!   resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:***:521520215337:service/mindplex-dev-cluster/mindplex-semantic-dev-service"
        name                               = "mindplex-semantic-dev-service"
        tags                               = {}
!       task_definition                    = "arn:aws:ecs:***:521520215337:task-definition/mindplex-semantic-dev:35" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.mindplex_semantic.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
!       arn                      = "arn:aws:ecs:***:521520215337:task-definition/mindplex-semantic-dev:35" -> (known after apply)
!       arn_without_revision     = "arn:aws:ecs:***:521520215337:task-definition/mindplex-semantic-dev" -> (known after apply)
!       container_definitions    = (sensitive value) # forces replacement
!       enable_fault_injection   = false -> (known after apply)
!       id                       = "mindplex-semantic-dev" -> (known after apply)
!       revision                 = 35 -> (known after apply)
-       tags                     = {} -> null
!       tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>